# Ablation: P2 branch + CBAM (no PuddleEdgeEnhance)
nc: 1
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, SCDown, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, SCDown, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 1, PSA, [1024]]            # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]       # cat P4
  - [-1, 3, C2f, [512]]             # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]       # cat P3
  - [-1, 3, C2f, [256]]             # 16 (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]       # cat P2
  - [-1, 3, C2f, [128]]             # 19 (P2/4)
  - [-1, 1, CBAM, [7]]              # 20 (P2 attention)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]      # merge back to P3
  - [-1, 3, C2f, [256]]             # 23 (P3 refined)
  - [-1, 1, CBAM, [7]]              # 24 (P3 attention)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]      # cat P4
  - [-1, 3, C2f, [512]]             # 27 (P4/16)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]      # cat P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 30 (P5/32)

  - [[20, 24, 27, 30], 1, v10Detect, [nc]] # Detect(P2, P3, P4, P5)
